'use strict'
// Необхідно написати програму, яка виконує складання чисел від N до M (N та M задаються користувачем), а також програма має вміти пропускати парні числа. Нижче приведено алгоритм, що потрібно зробити.
let N = prompt('Введіть будь ласка початкове значення');
//1. Отримати у користувача число N від якого ми будемо складати. Отримати число можна за допомогою promрt. Число не рядок!
console.log(Number(N));
//2. Перевірити чи отримане N число є цілим числом.
console.log('Чи ціле число N?',Number.isInteger(Number(N)));
//3.Отримати у користувача число М до якого ми будемо складати включно. Отримати число за допомогою promрt. Число не рядок!
let M = prompt('Введіть будь ласка кінцеве значення');
console.log(M);
//4.Перевірити чи отримане М число є цілим числом.
console.log('Чи ціле число М?',Number.isInteger(Number(M)));
//5.Отримати у користувача булевий параметир (true/false)? який підкаже нам чи потрібно пропускати парні числа.
let answer = confirm('Чи пропуска парні числа?');
alert(answer);

//6.Написати цикл, який буде складати числа від раніше отриманих.
//7. В циклі додати перевірку - чи потрібно пропускати при складані парні числа. Ящо парні треба пропускати не додавати їх до суми.

